#### 基本数据类型（字符串） ####

#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# 字符串的几种写法，它们可以相互嵌套起到一个相互转义的效果。
str1 = '大西瓜'
str2 = "大西瓜"
str3 = '''大西瓜''' # 三引号可以直接换行
str4 = """大西瓜""" # 三引号可以直接换行
str5 = '香蕉"你个"吧啦'
str6 = "香蕉\"你个\"吧啦"
str7 = "香蕉'你个'吧啦"
str8 = """香蕉"你个"吧啦"""
str9 = '香蕉"""你个"""吧啦'
str10 = """我
是
你
的
父
亲
"""

if __name__ == '__main__':
    print(str1, str2, str3, str4, str5, str6, str7, str8, str9)
    print("-------------------- 分隔符 --------------------")
    print(str10)
    print("-------------------- 分隔符 --------------------")
    print(f'你好：{str1}') # 占位符写法1
    print('你好：%s%s%s'%(str2,str4,str1), str10, sep='\n') # 占位符写法2
    print("-------------------- 分隔符 --------------------")
    s1 = '我是'
    s2 = '你爸爸'
    s3 = '的'
    print(s1 + s2) # 字符串拼接
    print(s1 + s2 *2 + s3 + s2 * 2) # 字符串复制
    print("-------------------- 分隔符 --------------------")
    st = '我是你的父亲大人，快跪下叫爸爸。'
    print(st[3:9]) # 字符串切片（正向切片）
    print(st[-12:-3]) # 字符串切片（反向切片）
    print(st[3:12:2]) # 字符串切片（设置步长）
    print(st.replace('，', '!')) # 字符串替换
    print(st.split('，')) # 字符串分割
    print('-'.join(st)) # 字符串拼接